#################################################################################
################################# VPC_2 CIDR ####################################
#################################################################################

variable "vpc_2_cidr" {
  type = string          
  default = "10.0.0.0/16"         # VPC IPv4 주소 범위
  description = "VPC_2 CIDR"      # Terraform 문서화 및 CLI 출력용 설명
}

#################################################################################
################################ Subnet CIDR ####################################
#################################################################################

############################### Public subnet CIDR ##############################

variable "public_subnet_cidr_v2" {
  type = string
  default = "10.0.1.0/24"       # Public Subnet IPv4 주소 범위
  description = "Daegok-public-subnet-1 CIDR"
}

############################### Private subnet CIDR ##############################

variable "private_subnet_cidr_v2" {
  type = string
  default = "10.0.2.0/24"       # Private Subnet IPv4 주소 범위
  description = "Daegok-private-subnet-1 CIDR"
}

#################################################################################
#################################### AZ #########################################
#################################################################################

################### Public/Private subnet 가용 영역(AZ) ##########################

variable "availability_zone_v2" {
  type        = string
  default     = "ap-northeast-2a"
  description = "Daegok-public/private-subnet AZ"
}
